diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	// ВКМ{
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 
			    		
		Элементы.ВКМ_ДатаНачала.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончания.Видимость = Истина;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧаса.Видимость = Истина;
		
	КонецЕсли;
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Покупатель
		ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Поставщик Тогда 
		
		Элементы.ВКМ_ДатаНачала.Видимость = Ложь;
		Объект.ВКМ_ДатаНачала = "";
		Элементы.ВКМ_ДатаОкончания.Видимость = Ложь;
		Объект.ВКМ_ДатаОкончания = "";
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Ложь;
		Объект.ВКМ_АбонентскаяПлата = "";
        Элементы.ВКМ_СтоимостьЧаса.Видимость = Ложь;  
		Объект.ВКМ_СтоимостьЧаса = "";
        	
	КонецЕсли;
	// }ВКМ
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ВКМ{
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачала"; 
	НовыйЭлемент.Видимость = Ложь;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончания"; 
	НовыйЭлемент.Видимость = Ложь;

	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата"; 
	НовыйЭлемент.Видимость = Ложь;

	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ВКМ_СтоимостьЧаса", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса"; 
	НовыйЭлемент.Видимость = Ложь;
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 
			    		
		Элементы.ВКМ_ДатаНачала.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончания.Видимость = Истина;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧаса.Видимость = Истина;
		
	КонецЕсли
    // }ВКМ

КонецПроцедуры
